---
type: AnalysisResultSchema
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 14
tags: [revit-api, class]
---

# AnalysisResultSchema

`Autodesk.Revit.DB.Analysis.AnalysisResultSchema` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | AnalysisResultSchema | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetNumberOfUnits | 2012 | `public int GetNumberOfUnits ()` |
| Method | GetUnitsMultiplier | 2012 | `public double GetUnitsMultiplier ( int index )` |
| Method | GetUnitsName | 2012 | `public string GetUnitsName ( int index )` |
| Method | IsEqual | 2012 | `public bool IsEqual ( AnalysisResultSchema other )` |
| Method | SetUnits | 2012 | `public void SetUnits ( IList < string > names , IList < double > multipliers )` |
| Property | AnalysisDisplayStyleId | 2012 | `public ElementId AnalysisDisplayStyleId { get ; set ; }` |
| Property | CurrentUnits | 2012 | `public int CurrentUnits { get ; set ; }` |
| Property | Description | 2012 | `public string Description { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | IsVisible | 2012 | `public bool IsVisible { get ; set ; }` |
| Property | Name | 2012 | `public string Name { get ; set ; }` |
| Property | Scale | 2012 | `public double Scale { get ; set ; }` |